app/controllers/api/v1/artists_controller.rb

  def index
    artists = Artist.all
    artists.empty? ? render(:json => [], :status => :no_content) : render(:json => artists, :status => :ok)
---
SELECT "artists".* FROM "artists"
SELECT COUNT(*) FROM "artists"

  def show
    artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    Artist.create(params[:artist])
---
INSERT INTO "artists" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 24 Jun 2013 21:08:02 UTC +00:00], ["name", "johan"], ["updated_at", Mon, 24 Jun 2013 21:08:02 UTC +00:00]]

  def update
    Artist.find(params[:id]).update(params[:artist])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = 5  [["name", "aap1234"], ["updated_at", Mon, 24 Jun 2013 21:27:08 UTC +00:00]]

  def destroy
    artist = Artist.find(params[:id])
    artist.destroy!
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "artists" WHERE "artists"."id" = 4